<a href="https://colab.research.google.com/github/vjbarayuga/Week2-Pandas-for-Data-Manipulation-CodingDojo/blob/main/TitanicDatasetAnalysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
# 1 Display the head of the dataframe
import pandas as pd
# Keep in mind that the filename will likely be different on your computer (especially later in course)
filename='/content/drive/MyDrive/Coding_DOJO-Data_Science_Bootcamp/02_Part_Time_Data_Science/2_Pandas_for_Data_Manipulation/Dataset/titanic.csv'
df = pd.read_csv(filename)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [3]:
# 2 Percentage of people who survived
df['Survived'].mean()

0.3838383838383838

In [4]:
# 3 How many of each sex survived
df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [5]:
# 4 Group of passengers who paid less than $10
df["Fare"] < 10
df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [22]:
# 5 Did not survive
did_not_survived_data = df[df['Survived'] == 0]
did_not_survive = did_not_survived_data.count().values[1]
did_not_survive
#did_not_survive_percent = (did_not_survive/891) * 100
#print('The percentage of who did not survive in the data are {}'.format(survival_percent))

549

In [14]:
# 5 Average age not survived
age_not_survived = did_not_survived_data.groupby(by=['Age'])[['Survived']].count().mean()
age_not_survived

Survived    5.506494
dtype: float64

In [24]:
# 6 Survived
survived_data = df[df['Survived'] == 1]
survived = survived_data.count().values[1]
survived
#survival_percent = (survived/891) * 100
#print('The percentage of who survived in the data are {}'.format(survival_percent))

342

In [27]:
# 6 Average age survived
age_survived = survived_data.groupby(by=['Age'])[['Survived']].count().mean()
age_survived

Survived    4.461538
dtype: float64

In [28]:
# 7 Average age of those who did and did not survive grouped by sex

age_survived = survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  28.847716
male    27.276022

In [29]:
# 7 Average age of those who did and did not survive grouped by sex

age_survived = did_not_survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  25.046875
male    31.618056

In [6]:

#PRACTICE CODE
#Overall average age of those who survived and did not survive
#df_new = df['Survived']
#df_new = df.loc[df_new, :]
#df_new = df['Survived'].value_counts(dropna = False)
#df_new
df_new = df['Survived']
df_new = df.loc[df_new, :]
survived = df['Survived'].value_counts(dropna = False)
survived

0    549
1    342
Name: Survived, dtype: int64

In [15]:
#PRACTICE CODE
#Overall average age of those who survived
#Overall average age of those who did not survive
#survived = df[df['Survived'] == 1]
#died = df[df['Survived'] == 0]
#print('Analysis of Survival')
#print('{0} survived the wreck'.format(survived.shape[0]))
#print('{0} did not survive the wreck'.format(died.shape[0]))
#survived_percent = round(((float(len(survived)/len(df))) * 100), 2)
#died_percent = round(((float(len(died)/len(df))) * 100), 2)
#print('Survival Percentage = {0} %'.format(survived_percent))
#print('Death Percentage = {0} %'.format(died_percent))

In [16]:
#PRACTICE CODE
#df[["Sex", "Age"]].groupby("Sex").mean()

In [17]:
#df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

In [18]:
#PRACTICE CODE
#df[["Sex", "Age","Survived"]].groupby("Sex").mean()

In [19]:
#PRACTICE CODE
#df.groupby('Sex').agg({'Age':'mean'})